 {"recipes":
 [
	
	
	{id:"explorepub",
	actionId: "explore",
	label: "Purchase Entry into the Salty-Spitoon",
	requirements: {locationpub:1,compensationvalue:1},
	startdescription:"I'm aware of a house of ill repute near the Great River, filled with drunkards and sweaty sailors. More interesting, however, is the basement below it, which houses the sailors that have exchanged the bottle for the knife, and the taste of blood and victory. The entrance fee is steep.",
	description: ".",
	effects: {compensationvalue:-1},
	craftable:true,
	deckeffect: {"pubevents":1},
	linked:[{id:"pubrevelry",chance:100},
	{id:"pubrowdy",chance:100},
	{id:"pubcamaraderie",chance:100},
	{id:"pubnostalgia",chance:100},
	{id:"pubdance",chance:100},
	{id:"pubexecution",chance:100},
	{id:"pubcorpse",chance:100},
	{id:"pubvictory",chance:100}]
	},
	
	{id:"explorepubalternative",
	actionId: "explore",
	label: "Entry into the Salty Spitoon",
	requirements: {locationpub:1,skillhealthd_strength:1},
	startdescription:"There is a figure that watches the entrance, judging the worth of the arriving supplicants. The figure glances at my muscles, which have grown thick as trees, and quickly allows me passage without the customary fee. Was it generosity, respect, or fear?",
	description: ".",
	effects: {},
	craftable:true,
	deckeffect: {"pubevents":1},
	linked:[{id:"pubrevelry",chance:100},
	{id:"pubrowdy",chance:100},
	{id:"pubcamaraderie",chance:100},
	{id:"pubnostalgia",chance:100},
	{id:"pubdance",chance:100},
	{id:"pubexecution",chance:100},
	{id:"pubcorpse",chance:100},
	{id:"pubvictory",chance:100}]
	},
		
	
	
	{id: "pubrevelry",
	label: "A Long Evening at the Salty Spitoon",
	actionId: "explore",
	requirements:{contentment:1},
	startdescription: "The air is thick with the emanations of cigars, and glasses full of viscous, burning alcohol are passed around. We play cards, but someone has sharpened their edges as finely as a razor. A common prank, I am assured.",
	description: "In the early morning hours, I make my escape, hands covered in many tiny wounds. The alcohol has settled in my stomach like a sleeping tiger, and I settle down for the deep sleep of the victorious.",
	warmup:15,
	craftable:false
	},
		{id: "pubrowdy",
	label: "A Rowdy Evening at the Salty Spitoon",
	actionId: "explore",
	requirements:{vitality:1},
	startdescription: "Tonight, we fight as pairs. Our limbs are tied together with leather belts, while each of us grasps a rusty blade between our teeth.",
	description: "For a while, the only sound that penetrates the basement is the tearing of flesh, and the dull impact of skull upon skull. We are not victorious, that honor goes to another, but perhaps survival is a victory on its own.",
	effects:{contentment:1},
	warmup:15,
	craftable:false
	},
		{id: "pubcamaraderie",
	label: "Favors Owed at the Salty Spitoon",
	actionId: "explore",
	requirements:{hireling:1},
	startdescription: "The Spitoon has an economy of its own. 'Fingers for favors', goes the proverb, but only fingers taken inside these hallowed walls hold any worth to these scarred men and women.",
	description: "The constant danger sharpens the senses, and excites the passions, making it difficult to reap a sizeable harvest. But at the end of the evening, I have taken a finger in a moment of lacking vigilance. Though the former owner is less than thrilled, the rules of the house are iron-clad. He owes me a favor.",
	effects:{contentment:1},
	warmup:15,
	craftable:false
	},
		{id: "pubnostalgia",
	label: "Nostalgia at the Salty Spitoon",
	actionId: "explore",
	requirements:{locationstreetsstrange:1},
	startdescription: "Today, an hour before noon, the Spitoon covers its windows, and closes its doors to new visitors. The atmosphere is muted, and no sound is heard, as the sailors begin to serve eachother a clear liquor that glistens like moonshine. ",
	description: "With practiced care, we drink in unison, and tears begin to flow, glowing with a soft, white, radiance. Soon after, we emerge back into the light of noon, our bodies bright and resplendent, though our minds are filled with thoughts of far-away places.",
	warmup:15,
	craftable:false
	},
			{id: "pubdance",
	label: "A Dance at the Salty Spitoon",
	actionId: "explore",
	requirements:{influencegrailc:1},
	startdescription: "Tonight, the owner of the establishment has ordered entertainment from the Ecdysis Club. Dancers and sailors alike begin to tie fishing hooks, razors, whatever sharp things they can find, onto their limbs. I ready myself for a rough evening.",
	description: "We move wildly, and the bodies of the celebrants spill around the room like waves, rubbing against eachother in a most excruciating manner. The floor grows slick with blood, and soon, viscera. After the first dancers collapse, the pain of the slicing blades is replaced with the sweet agony of scratching nails and frantic biting. We emerge unscarred, but not unscathed. ",
	effects:{contentment:1},
	warmup:15,
	craftable:false
	},
			{id: "pubexecution",
	label: "An Interruption at the Salty Spitoon",
	actionId: "explore",
	requirements:{notoriety:1},
	startdescription: "Our evening is interrupted by frantic shouting, as a group of young men wielding nightsticks and righteous anger spill into the room. The Bureau usually does not dare enter the Spitoon, which means these ones were foolish enough to anger their superiors.",
	description: "We let them gloat, for a while. Cold, steel cuffs are clasped onto our wrists, until, suddenly, they aren't. The river bubbles with indignation, forced to accept the third pile of bodies this week. The neighbours know better than to stare, though one of them will talk. They always do.",
	warmup:15,
	craftable:false
	},
			{id: "pubcorpse",
	label: "Cleaning Duty at the Salty Spitoon",
	actionId: "explore",
	requirements:{corpse:1},
	startdescription: "Keeping an establishment like this running requires that certain duties be performed, even by the guests. Tonight, one of these duties has been entrusted to you.",
	description: "'You will handle this matter,' a rough-hewn sailor whispers, 'with discretion. Know that our senior patrons will remember your service.' I find myself at the back entrance of the Spitoon, carrying a heavy bag over my shoulder.",
	effects: {favour:1},
	warmup:15,
	craftable:false
	},
			{id: "pubvictory",
	label: "A Duel at the Salty Spitoon",
	actionId: "explore",
	requirements:{influenceedgec:1},
	startdescription: "The tension in the room coils around the throats of the assembled, like the body of a snake. One of the older patrons beats an old leather drum. Once it breaks, the younger patrons continue to beat on the tables, until their fists grow bloody.",
	description: "Me and my opponent face eachother. He is inebriated with beer. I am inebriated with purpose, which guides my hand as it impacts his throat, crushing his windpipe. Soon, the others join in. It's not pretty, one would say, but in this place all endings are beautiful.",
	effects:{contentment:1},
	warmup:15,
	craftable:false
	}

]
}